In [1]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [8]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
.....:
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
.....:
 columns=['one', 'two', 'three', 'four'])

In [17]:
 frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
.....:
 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [20]:
type(np.abs(frame))

pandas.core.frame.DataFrame

In [23]:
frame

               b         d         e
Utah    1.427966  1.154460 -1.255681
Ohio    0.604094  0.434150 -1.836742
Texas  -1.123070  0.075486 -0.176957
Oregon  0.181960 -1.220290 -0.765942

In [24]:
f = lambda x: x.max() - x.min()
frame.apply(f,axis=1)

Utah      2.683647
Ohio      2.440836
Texas     1.198556
Oregon    1.402250
dtype: float64

In [26]:
 df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
.....:
 [np.nan, np.nan], [0.75, -1.3]],
.....:
 index=['a', 'b', 'c', 'd'],
.....:
 columns=['one', 'two'])

In [29]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [33]:
df.idxmax()

one    b
two    d
dtype: object

In [3]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [12]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [15]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
.....:
 'Qu2': [2, 3, 1, 2, 3],
.....:
 'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [13]:
result = data.apply(pd.value_counts).fillna(0)

In [20]:
NA=np.nan
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                        [NA, NA, NA], [NA, 6.5, 3.]])

In [30]:
cleanded = data.dropna(thresh=3)
cleanded

     0    1    2
0  1.0  6.5  3.0

In [32]:
data = pd.Series(np.random.randn(10),
.....:
 index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
.....:
 [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [36]:
data.unstack()

          1         2         3
a -0.173567  0.550294  0.041114
b -0.322837 -0.529355  0.169772
c  0.380074  0.155453       NaN
d       NaN  0.250425  0.445052

In [38]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
.....:
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
.....:
 columns=[['Ohio', 'Ohio', 'Colorado'],
.....:
 ['Green', 'Red', 'Green']])

In [42]:
frame.index.names

FrozenList([None, None])